package ru.psu.techjava.services

import ru.psu.techjava.model.CStudent
import ru.psu.techjava.repositories.CRepositoryStudents
import tornadofx.*

/********************************************************************************************************
 * Сервис с логикой для работы со списком студентов.                                                    *
 * @author Селетков И.П. 2022 1128.                                                                     *
 *******************************************************************************************************/
class CServiceStudents                      : Controller()
{
    private val repositoryStudents          : CRepositoryStudents by inject()
    /****************************************************************************************************
     * Запрос списка всех доступных объектов на сервере.                                                *
     ***************************************************************************************************/
    fun getAll()                            = repositoryStudents.getAll()

    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param student - объект для отправки.                                                            *
     ***************************************************************************************************/
    fun save(
        student                             : CStudent
    )                                       = repositoryStudents.save(student)
}