package ru.psu.techjava.repositories

import javafx.collections.ObservableList
import ru.psu.techjava.model.CStudent
import tornadofx.*

/********************************************************************************************************
 * Репозиторий с запросами к серверу в части списка студентов.                                          *
 * @author Селетков И.П. 2022 1128.                                                                     *
 * @link https://github.com/edvin/tornadofx/wiki/REST-Client                                            *
 *******************************************************************************************************/
class CRepositoryStudents                   : Controller()
{
    private val api                         : Rest by inject()
    /****************************************************************************************************
     * Запрос списка всех доступных объектов на сервере.                                                *
     ***************************************************************************************************/
    fun getAll()                            : ObservableList<CStudent>
                                            = api.get("students")
            .list()
            .toModel()

    /****************************************************************************************************
     * Отправка данных объекта на сервер.                                                               *
     * @param student - объект для отправки.                                                            *
     ***************************************************************************************************/
    fun save(
        student                             : CStudent
    )
    {
        api.post("students", student)
    }
}